buoyantPimpleFoam-shuikuijisuan/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          494;
        startFace       235294;
    }
    outletwater
    {
        type            patch;
        nFaces          16;
        startFace       235788;
    }
    outlet
    {
        type            patch;
        nFaces          2600;
        startFace       235804;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9902;
        startFace       238404;
    }
)

// ************************************************************************* //
