buoyantPimpleFoam-shuikuijisuan/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0.305 0.91)//0
    
    (0 0.305 0.61)
    (6.1 0 0.61)
    (24.39 0 0)
    (0 0.305 0.66)
    (6.1 0 0.66)
    (24.39 0 0.15)
    (0 0.305 0.6675)
    (6.1 0 0.6675)
    (24.39 0 0.1725)
    (0 0.305 0.76)
    (6.1 0 0.76)
    (24.39 0 0.45)
    (6.1 0 0.91)
    (24.39 0 0.91)//14

    (0 0.44375 0.91)
    
    (0 0.44375 0.61)
    (6.1 0.44375 0.61)
    (24.39 0.44375 0)
    (0 0.44375 0.66)
    (6.1 0.44375 0.66)
    (24.39 0.44375 0.15)
    (0 0.44375 0.6675)
    (6.1 0.44375 0.6675)
    (24.39 0.44375 0.1725)
    (0 0.44375 0.76)
    (6.1 0.44375 0.76)
    (24.39 0.44375 0.45)
    (6.1 0.44375 0.91)
    (24.39 0.44375 0.91)//29

    (0 0.46625 0.91)
    
    (0 0.46625 0.61)
    (6.1 0.46625 0.61)
    (24.39 0.46625 0)
    (0 0.46625 0.66)
    (6.1 0.46625 0.66)
    (24.39 0.46625 0.15)
    (0 0.46625 0.6675)
    (6.1 0.46625 0.6675)
    (24.39 0.46625 0.1725)
    (0 0.46625 0.76)
    (6.1 0.46625 0.76)
    (24.39 0.46625 0.45)
    (6.1 0.46625 0.91)
    (24.39 0.46625 0.91)//44
    
    (0 0.605 0.91)
    
    (0 0.605 0.61)
    (6.1 0.91 0.61)
    (24.39 0.91 0)
    (0 0.605 0.66)
    (6.1 0.91 0.66)
    (24.39 0.91 0.15)
    (0 0.605 0.6675)
    (6.1 0.91 0.6675)
    (24.39 0.91 0.1725)
    (0 0.605 0.76)
    (6.1 0.91 0.76)
    (24.39 0.91 0.45)
    (6.1 0.91 0.91)
    (24.39 0.91 0.91)//59
  
);

blocks
(
 
    hex (15 25 26 28 0 10 11 13) (12 40 11) simpleGrading (1 1 1)
    hex (25 22 23 26 10 7 8 11) (7 40 11) simpleGrading (1 1 1)
    hex (22 19 20 23 7 4 5 8) (4 40 11) simpleGrading (1 1 1)
    hex (19 16 17 20 4 1 2 5) (8 40 11) simpleGrading (1 1 1)
    hex (28 26 27 29 13 11 12 14) (12 60 11) simpleGrading (1 1 1)
    hex (26 23 24 27 11 8 9 12) (7 60 11) simpleGrading (1 1 1)
    hex (23 20 21 24 8 5 6 9) (4 60 11) simpleGrading (1 1 1) 
    hex (20 17 18 21 5 2 3 6) (8 60 11) simpleGrading (1 1 1)
   
    hex (30 40 41 43 15 25 26 28) (12 40 4) simpleGrading (1 1 1)
    hex (40 37 38 41 25 22 23 26) (7 40 4) simpleGrading (1 1 1)
    hex (37 34 35 38 22 19 20 23) (4 40 4) simpleGrading (1 1 1)
    hex (34 31 32 35 19 16 17 20) (8 40 4) simpleGrading (1 1 1)
    hex (43 41 42 44 28 26 27 29) (12 60 4) simpleGrading (1 1 1)
    hex (41 38 39 42 26 23 24 27) (7 60 4) simpleGrading (1 1 1)
    hex (38 35 36 39 23 20 21 24) (4 60 4) simpleGrading (1 1 1) 
    hex (35 32 33 36 20 17 18 21) (8 60 4) simpleGrading (1 1 1)

    hex (45 55 56 58 30 40 41 43) (12 40 11) simpleGrading (1 1 1)
    hex (55 52 53 56 40 37 38 41) (7 40 11) simpleGrading (1 1 1)
    hex (52 49 50 53 37 34 35 38) (4 40 11) simpleGrading (1 1 1)
    hex (49 46 47 50 34 31 32 35) (8 40 11) simpleGrading (1 1 1)
    hex (58 56 57 59 43 41 42 44) (12 60 11) simpleGrading (1 1 1)
    hex (56 53 54 57 41 38 39 42) (7 60 11) simpleGrading (1 1 1)
    hex (53 50 51 54 38 35 36 39) (4 60 11) simpleGrading (1 1 1) 
    hex (50 47 48 51 35 32 33 36) (8 60 11) simpleGrading (1 1 1)

);

edges
(
    
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 4 19 16)
            (4 7 22 19)
            (7 10 25 22)

            (16 19 34 31)
            (19 22 37 34)
            (22 25 40 37)

            (31 34 49 46)
            (49 52 37 34)
            (52 55 40 37)
        );
    }
    
    outletwater
    {
        type patch;
        faces
        (
            (36 39 24 21)
        );
    }
    
    
    outlet
    {
        type patch;
        faces
        (
            (13 14 29 28)
            (0 13 28 15)
            (43 30 15 28)
            (44 43 28 29)
            (30 43 58 45)
            (43 44 59 58)
        );
    }
    
);  

mergePatchPairs
(
);


// ************************************************************************* //
